adventure-works/schemaspy/diagrams/tables/DimEmployee.1degree.dot
digraph "oneDegreeRelationshipsDiagram" {
  graph [    rankdir="RL"    bgcolor="#ffffff"    label="\nGenerated by SchemaSpy"    labeljust="l"    nodesep="0.18"    ranksep="0.46"    fontname="Helvetica"    fontsize="11"    ration="compress"  ];  node [    fontname="Helvetica"    fontsize="11"    shape="plaintext"  ];  edge [    arrowsize="0.8"  ];
  "DimEmployee":"ParentEmployeeKey":w -> "DimEmployee":"EmployeeKey.type":e [arrowhead=none dir=back arrowtail=crowodot];
  "DimEmployee":"SalesTerritoryKey":w -> "DimSalesTerritory":"SalesTerritoryKey":e [arrowhead=none dir=back arrowtail=crowodot];
  "FactResellerSales":"EmployeeKey":w -> "DimEmployee":"EmployeeKey.type":e [arrowhead=none dir=back arrowtail=crowodot];
  "FactResellerSales":"SalesTerritoryKey":w -> "DimSalesTerritory":"SalesTerritoryKey":e [arrowhead=none dir=back arrowtail=crowodot];
  "FactSalesQuota":"EmployeeKey":w -> "DimEmployee":"EmployeeKey.type":e [arrowhead=none dir=back arrowtail=crowodot];
  "DimEmployee" [
   label=<
    <TABLE BORDER="2" CELLBORDER="1" CELLSPACING="0" BGCOLOR="#ffffff">
      <TR><TD COLSPAN="4"  BGCOLOR="#f5f5f5"><TABLE BORDER="0" CELLSPACING="0"><TR><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="82" HEIGHT="16"><B>DimEmployee</B></TD><TD ALIGN="RIGHT">[table]</TD></TR></TABLE></TD></TR>
      <TR><TD PORT="EmployeeKey" COLSPAN="2" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"><IMG SRC="../../images/primaryKeys.png"/></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="242" HEIGHT="16">EmployeeKey</TD></TR></TABLE></TD><TD PORT="EmployeeKey.type" ALIGN="LEFT">int identity[4]</TD></TR>
      <TR><TD PORT="ParentEmployeeKey" COLSPAN="2" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"><IMG SRC="../../images/foreignKeys.png"/></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="242" HEIGHT="16">ParentEmployeeKey</TD></TR></TABLE></TD><TD PORT="ParentEmployeeKey.type" ALIGN="LEFT">int[4]</TD></TR>
      <TR><TD PORT="EmployeeNationalIDAlternateKey" COLSPAN="2" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="242" HEIGHT="16">EmployeeNationalIDAlternateKey</TD></TR></TABLE></TD><TD PORT="EmployeeNationalIDAlternateKey.type" ALIGN="LEFT">nvarchar[30]</TD></TR>
      <TR><TD PORT="ParentEmployeeNationalIDAlternateKey" COLSPAN="2" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="242" HEIGHT="16">ParentEmployeeNationalIDAlternateKey</TD></TR></TABLE></TD><TD PORT="ParentEmployeeNationalIDAlternateKey.type" ALIGN="LEFT">nvarchar[30]</TD></TR>
      <TR><TD PORT="SalesTerritoryKey" COLSPAN="2" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"><IMG SRC="../../images/foreignKeys.png"/></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="242" HEIGHT="16">SalesTerritoryKey</TD></TR></TABLE></TD><TD PORT="SalesTerritoryKey.type" ALIGN="LEFT">int[4]</TD></TR>
      <TR><TD PORT="FirstName" COLSPAN="2" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="242" HEIGHT="16">FirstName</TD></TR></TABLE></TD><TD PORT="FirstName.type" ALIGN="LEFT">nvarchar[100]</TD></TR>
      <TR><TD PORT="LastName" COLSPAN="2" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="242" HEIGHT="16">LastName</TD></TR></TABLE></TD><TD PORT="LastName.type" ALIGN="LEFT">nvarchar[100]</TD></TR>
      <TR><TD PORT="MiddleName" COLSPAN="2" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="242" HEIGHT="16">MiddleName</TD></TR></TABLE></TD><TD PORT="MiddleName.type" ALIGN="LEFT">nvarchar[100]</TD></TR>
      <TR><TD PORT="NameStyle" COLSPAN="2" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="242" HEIGHT="16">NameStyle</TD></TR></TABLE></TD><TD PORT="NameStyle.type" ALIGN="LEFT">bit[1]</TD></TR>
      <TR><TD PORT="Title" COLSPAN="2" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="242" HEIGHT="16">Title</TD></TR></TABLE></TD><TD PORT="Title.type" ALIGN="LEFT">nvarchar[100]</TD></TR>
      <TR><TD PORT="HireDate" COLSPAN="2" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="242" HEIGHT="16">HireDate</TD></TR></TABLE></TD><TD PORT="HireDate.type" ALIGN="LEFT">date[6]</TD></TR>
      <TR><TD PORT="BirthDate" COLSPAN="2" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="242" HEIGHT="16">BirthDate</TD></TR></TABLE></TD><TD PORT="BirthDate.type" ALIGN="LEFT">date[6]</TD></TR>
      <TR><TD PORT="LoginID" COLSPAN="2" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="242" HEIGHT="16">LoginID</TD></TR></TABLE></TD><TD PORT="LoginID.type" ALIGN="LEFT">nvarchar[512]</TD></TR>
      <TR><TD PORT="EmailAddress" COLSPAN="2" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="242" HEIGHT="16">EmailAddress</TD></TR></TABLE></TD><TD PORT="EmailAddress.type" ALIGN="LEFT">nvarchar[100]</TD></TR>
      <TR><TD PORT="Phone" COLSPAN="2" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="242" HEIGHT="16">Phone</TD></TR></TABLE></TD><TD PORT="Phone.type" ALIGN="LEFT">nvarchar[50]</TD></TR>
      <TR><TD PORT="MaritalStatus" COLSPAN="2" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="242" HEIGHT="16">MaritalStatus</TD></TR></TABLE></TD><TD PORT="MaritalStatus.type" ALIGN="LEFT">nchar[2]</TD></TR>
      <TR><TD PORT="EmergencyContactName" COLSPAN="2" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="242" HEIGHT="16">EmergencyContactName</TD></TR></TABLE></TD><TD PORT="EmergencyContactName.type" ALIGN="LEFT">nvarchar[100]</TD></TR>
      <TR><TD PORT="EmergencyContactPhone" COLSPAN="2" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="242" HEIGHT="16">EmergencyContactPhone</TD></TR></TABLE></TD><TD PORT="EmergencyContactPhone.type" ALIGN="LEFT">nvarchar[50]</TD></TR>
      <TR><TD PORT="SalariedFlag" COLSPAN="2" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="242" HEIGHT="16">SalariedFlag</TD></TR></TABLE></TD><TD PORT="SalariedFlag.type" ALIGN="LEFT">bit[1]</TD></TR>
      <TR><TD PORT="Gender" COLSPAN="2" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="242" HEIGHT="16">Gender</TD></TR></TABLE></TD><TD PORT="Gender.type" ALIGN="LEFT">nchar[2]</TD></TR>
      <TR><TD PORT="PayFrequency" COLSPAN="2" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="242" HEIGHT="16">PayFrequency</TD></TR></TABLE></TD><TD PORT="PayFrequency.type" ALIGN="LEFT">tinyint[1]</TD></TR>
      <TR><TD PORT="BaseRate" COLSPAN="2" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="242" HEIGHT="16">BaseRate</TD></TR></TABLE></TD><TD PORT="BaseRate.type" ALIGN="LEFT">money[21,4]</TD></TR>
      <TR><TD PORT="VacationHours" COLSPAN="2" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="242" HEIGHT="16">VacationHours</TD></TR></TABLE></TD><TD PORT="VacationHours.type" ALIGN="LEFT">smallint[2]</TD></TR>
      <TR><TD PORT="SickLeaveHours" COLSPAN="2" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="242" HEIGHT="16">SickLeaveHours</TD></TR></TABLE></TD><TD PORT="SickLeaveHours.type" ALIGN="LEFT">smallint[2]</TD></TR>
      <TR><TD PORT="CurrentFlag" COLSPAN="2" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="242" HEIGHT="16">CurrentFlag</TD></TR></TABLE></TD><TD PORT="CurrentFlag.type" ALIGN="LEFT">bit[1]</TD></TR>
      <TR><TD PORT="SalesPersonFlag" COLSPAN="2" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="242" HEIGHT="16">SalesPersonFlag</TD></TR></TABLE></TD><TD PORT="SalesPersonFlag.type" ALIGN="LEFT">bit[1]</TD></TR>
      <TR><TD PORT="DepartmentName" COLSPAN="2" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="242" HEIGHT="16">DepartmentName</TD></TR></TABLE></TD><TD PORT="DepartmentName.type" ALIGN="LEFT">nvarchar[100]</TD></TR>
      <TR><TD PORT="StartDate" COLSPAN="2" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="242" HEIGHT="16">StartDate</TD></TR></TABLE></TD><TD PORT="StartDate.type" ALIGN="LEFT">date[6]</TD></TR>
      <TR><TD PORT="EndDate" COLSPAN="2" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="242" HEIGHT="16">EndDate</TD></TR></TABLE></TD><TD PORT="EndDate.type" ALIGN="LEFT">date[6]</TD></TR>
      <TR><TD PORT="Status" COLSPAN="2" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="242" HEIGHT="16">Status</TD></TR></TABLE></TD><TD PORT="Status.type" ALIGN="LEFT">nvarchar[100]</TD></TR>
      <TR><TD PORT="EmployeePhoto" COLSPAN="2" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="242" HEIGHT="16">EmployeePhoto</TD></TR></TABLE></TD><TD PORT="EmployeePhoto.type" ALIGN="LEFT">varbinary[2147483647]</TD></TR>
      <TR><TD ALIGN="LEFT" BGCOLOR="#ffffff">&lt; 2</TD><TD ALIGN="RIGHT" BGCOLOR="#ffffff">296 rows</TD><TD ALIGN="RIGHT" BGCOLOR="#ffffff">3 &gt;</TD></TR>
    </TABLE>>
    URL="DimEmployee.html"
    target="_top"
    tooltip="DimEmployee"
  ];
  "DimSalesTerritory" [
   label=<
    <TABLE BORDER="0" CELLBORDER="1" CELLSPACING="0" BGCOLOR="#ffffff">
      <TR><TD COLSPAN="3"  BGCOLOR="#f5f5f5"><TABLE BORDER="0" CELLSPACING="0"><TR><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="108" HEIGHT="16"><B>DimSalesTerritory</B></TD><TD ALIGN="RIGHT">[table]</TD></TR></TABLE></TD></TR>
      <TR><TD PORT="SalesTerritoryKey" COLSPAN="3" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"><IMG SRC="../../images/primaryKeys.png"/></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="163" HEIGHT="16">SalesTerritoryKey</TD></TR></TABLE></TD></TR>
      <TR><TD PORT="SalesTerritoryAlternateKey" COLSPAN="3" BGCOLOR="#ffffff" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="163" HEIGHT="16">SalesTerritoryAlternateKey</TD></TR></TABLE></TD></TR>
      <TR><TD PORT="elipses" COLSPAN="3" ALIGN="LEFT">...</TD></TR>
      <TR><TD ALIGN="LEFT" BGCOLOR="#ffffff">  </TD><TD ALIGN="RIGHT" BGCOLOR="#ffffff">11 rows</TD><TD ALIGN="RIGHT" BGCOLOR="#ffffff">4 &gt;</TD></TR>
    </TABLE>>
    URL="DimSalesTerritory.html"
    target="_top"
    tooltip="DimSalesTerritory"
  ];
  "FactResellerSales" [
   label=<
    <TABLE BORDER="0" CELLBORDER="1" CELLSPACING="0" BGCOLOR="#ffffff">
      <TR><TD COLSPAN="3"  BGCOLOR="#f5f5f5"><TABLE BORDER="0" CELLSPACING="0"><TR><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="103" HEIGHT="16"><B>FactResellerSales</B></TD><TD ALIGN="RIGHT">[table]</TD></TR></TABLE></TD></TR>
      <TR><TD PORT="ProductKey" COLSPAN="3" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"><IMG SRC="../../images/foreignKeys.png"/></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="143" HEIGHT="16">ProductKey</TD></TR></TABLE></TD></TR>
      <TR><TD PORT="OrderDateKey" COLSPAN="3" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"><IMG SRC="../../images/foreignKeys.png"/></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="143" HEIGHT="16">OrderDateKey</TD></TR></TABLE></TD></TR>
      <TR><TD PORT="DueDateKey" COLSPAN="3" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"><IMG SRC="../../images/foreignKeys.png"/></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="143" HEIGHT="16">DueDateKey</TD></TR></TABLE></TD></TR>
      <TR><TD PORT="ShipDateKey" COLSPAN="3" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"><IMG SRC="../../images/foreignKeys.png"/></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="143" HEIGHT="16">ShipDateKey</TD></TR></TABLE></TD></TR>
      <TR><TD PORT="ResellerKey" COLSPAN="3" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"><IMG SRC="../../images/foreignKeys.png"/></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="143" HEIGHT="16">ResellerKey</TD></TR></TABLE></TD></TR>
      <TR><TD PORT="EmployeeKey" COLSPAN="3" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"><IMG SRC="../../images/foreignKeys.png"/></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="143" HEIGHT="16">EmployeeKey</TD></TR></TABLE></TD></TR>
      <TR><TD PORT="PromotionKey" COLSPAN="3" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"><IMG SRC="../../images/foreignKeys.png"/></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="143" HEIGHT="16">PromotionKey</TD></TR></TABLE></TD></TR>
      <TR><TD PORT="CurrencyKey" COLSPAN="3" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"><IMG SRC="../../images/foreignKeys.png"/></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="143" HEIGHT="16">CurrencyKey</TD></TR></TABLE></TD></TR>
      <TR><TD PORT="SalesTerritoryKey" COLSPAN="3" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"><IMG SRC="../../images/foreignKeys.png"/></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="143" HEIGHT="16">SalesTerritoryKey</TD></TR></TABLE></TD></TR>
      <TR><TD PORT="SalesOrderNumber" COLSPAN="3" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"><IMG SRC="../../images/primaryKeys.png"/></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="143" HEIGHT="16">SalesOrderNumber</TD></TR></TABLE></TD></TR>
      <TR><TD PORT="SalesOrderLineNumber" COLSPAN="3" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"><IMG SRC="../../images/primaryKeys.png"/></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="143" HEIGHT="16">SalesOrderLineNumber</TD></TR></TABLE></TD></TR>
      <TR><TD PORT="elipses" COLSPAN="3" ALIGN="LEFT">...</TD></TR>
      <TR><TD ALIGN="LEFT" BGCOLOR="#ffffff">&lt; 9</TD><TD ALIGN="RIGHT" BGCOLOR="#ffffff">60,855 rows</TD><TD ALIGN="RIGHT" BGCOLOR="#ffffff">  </TD></TR>
    </TABLE>>
    URL="FactResellerSales.html"
    target="_top"
    tooltip="FactResellerSales"
  ];
  "FactSalesQuota" [
   label=<
    <TABLE BORDER="0" CELLBORDER="1" CELLSPACING="0" BGCOLOR="#ffffff">
      <TR><TD COLSPAN="3"  BGCOLOR="#f5f5f5"><TABLE BORDER="0" CELLSPACING="0"><TR><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="93" HEIGHT="16"><B>FactSalesQuota</B></TD><TD ALIGN="RIGHT">[table]</TD></TR></TABLE></TD></TR>
      <TR><TD PORT="SalesQuotaKey" COLSPAN="3" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"><IMG SRC="../../images/primaryKeys.png"/></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="116" HEIGHT="16">SalesQuotaKey</TD></TR></TABLE></TD></TR>
      <TR><TD PORT="EmployeeKey" COLSPAN="3" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"><IMG SRC="../../images/foreignKeys.png"/></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="116" HEIGHT="16">EmployeeKey</TD></TR></TABLE></TD></TR>
      <TR><TD PORT="DateKey" COLSPAN="3" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"><IMG SRC="../../images/foreignKeys.png"/></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="116" HEIGHT="16">DateKey</TD></TR></TABLE></TD></TR>
      <TR><TD PORT="elipses" COLSPAN="3" ALIGN="LEFT">...</TD></TR>
      <TR><TD ALIGN="LEFT" BGCOLOR="#ffffff">&lt; 2</TD><TD ALIGN="RIGHT" BGCOLOR="#ffffff">163 rows</TD><TD ALIGN="RIGHT" BGCOLOR="#ffffff">  </TD></TR>
    </TABLE>>
    URL="FactSalesQuota.html"
    target="_top"
    tooltip="FactSalesQuota"
  ];
}
